varunmarolia/Tarang/arch/cpu/efr32/serial-arch.c
  /* Don't enable uart upon initialization */
  uart_init.enable = usartDisable;
  /* Initialize the UART in async mode */
  USART_InitAsync(bus_config->SPI_UART_USARTx, &uart_init);
  /* Raise TXBL interrupt as soon as there is at least one empty slot */
  bus_config->SPI_UART_USARTx->CTRL |= USART_CTRL_TXBIL;

  if(bus_config->uart_mode != UART_MODE_TX_ONLY) {
    bus_config->SPI_UART_USARTx->ROUTELOC0 = (bus_config->SPI_UART_USARTx->ROUTELOC0 
                                            & ~(_USART_ROUTELOC0_TXLOC_MASK | _USART_ROUTELOC0_RXLOC_MASK ))
                                            | (bus_config->data_out_loc << _USART_ROUTELOC0_TXLOC_SHIFT)
                                            | (bus_config->data_in_loc << _USART_ROUTELOC0_RXLOC_SHIFT);
    bus_config->SPI_UART_USARTx->ROUTEPEN |= USART_ROUTEPEN_RXPEN | USART_ROUTEPEN_TXPEN;
  } else {
    bus_config->SPI_UART_USARTx->ROUTELOC0 = (bus_config->SPI_UART_USARTx->ROUTELOC0 
                                            & ~(_USART_ROUTELOC0_TXLOC_MASK | _USART_ROUTELOC0_RXLOC_MASK ))
                                            | (bus_config->data_out_loc << _USART_ROUTELOC0_TXLOC_SHIFT);
    bus_config->SPI_UART_USARTx->ROUTEPEN |= USART_ROUTEPEN_TXPEN;
  }

  if(bus_config->uart_mode == UART_MODE_TX_RX_FLOW) {
    bus_config->SPI_UART_USARTx->ROUTELOC1 = ((bus_config->rts_loc << _USART_ROUTELOC1_RTSLOC_SHIFT) 
                                              | (bus_config->cts_loc << _USART_ROUTELOC1_CTSLOC_SHIFT));
    bus_config->SPI_UART_USARTx->ROUTEPEN |= USART_ROUTEPEN_RTSPEN | USART_ROUTEPEN_CTSPEN;
  }
  /* clear any uart peripheral interrupt */
  USART_IntClear(bus_config->SPI_UART_USARTx, _USART_IF_MASK);
  /* Clear any pending IRQ request for UART */
  serial_uart_NVIC_clear_interrupt(bus_config->SPI_UART_USARTx, RX_NVIC);
  serial_uart_NVIC_clear_interrupt(bus_config->SPI_UART_USARTx, TX_NVIC);
  USART_Enable(bus_config->SPI_UART_USARTx, usartEnable);        /* Enable transmit and receive */
  //USART_IntEnable(bus_config->SPI_UART_USARTx, USART_IF_TXBL);   /* Enable transmit buffer empty interrupt */

  /* DEBUG_USART_TX_IRQn will be enabled in NVIC when there is data to send */
  return BUS_OK;
}
/*---------------------------------------------------------------------------*/
static serial_bus_status_t 
i2c_return_to_bus_status(I2C_TransferReturn_TypeDef i2c_ret)
{
  switch (i2c_ret)
  {
  case i2cTransferInProgress:
    return BUS_TIMEOUT;
    break;
  case i2cTransferDone:
    return BUS_OK;
    break;
  case i2cTransferNack:
    return BUS_DATA_NACK;
    break;
  case i2cTransferBusErr:
  case i2cTransferArbLost:
  case i2cTransferUsageFault:
  case i2cTransferSwFault:
    return BUS_UNKNOWN_ERROR;
    break;
  default:
    return BUS_UNKNOWN_ERROR;
    break;
  }
}
/*---------------------------------------------------------------------------*/
void 
serial_arch_chip_select(serial_dev_t *dev, uint8_t on_off)
{
  if(dev->cs_config == NULL) {
    return;
  }
  GPIO_PinModeSet(dev->cs_config->port, dev->cs_config->pin, gpioModePushPull, 1);
  if (on_off == CHIP_SELECT_ENABLE) {
    if(dev->cs_config->logic == ENABLE_ACTIVE_LOW) {
      GPIO_PinOutClear(dev->cs_config->port , dev->cs_config->pin);
    } else {
      GPIO_PinOutSet(dev->cs_config->port , dev->cs_config->pin);
    }
    if(dev->power_up_delay_ms) {
      clock_wait_ms(dev->power_up_delay_ms);
    }
  } else {
    if(dev->cs_config->logic == ENABLE_ACTIVE_LOW) {
      GPIO_PinOutSet(dev->cs_config->port , dev->cs_config->pin);
    } else {
      GPIO_PinOutClear(dev->cs_config->port , dev->cs_config->pin);
    }
  }
}
/*---------------------------------------------------------------------------*/
bool
serial_arch_chip_is_selected(serial_dev_t *dev)
{
  bool cs_enabled;
  
  if(dev->cs_config == NULL) {
    return false;
  }

  cs_enabled = GPIO_PinOutGet(dev->cs_config->port, dev->cs_config->pin);
  if(dev->cs_config->logic == ENABLE_ACTIVE_LOW) {
    cs_enabled = !cs_enabled;
  }

  return cs_enabled;
}
/*---------------------------------------------------------------------------*/
serial_bus_status_t 
serial_arch_lock(serial_dev_t *dev)
{
  serial_bus_config_t *bus_config = &dev->bus->config;
  serial_bus_status_t bus_status = BUS_OK;
  /* check if bus is already locked by some other device */
  if(dev->bus->lock && dev->bus->current_dev != dev) {
    /* if timer timedout for the device holding the bus, unlock the bus */
    if(dev->timeout_ms && timer_timedout(&bus_config->bus_timer)) {
      serial_arch_unlock(dev);
    } else {
      PRINTF("Serial bus (%s): bus is locked\n", __func__);
      return BUS_LOCKED;
    }
  }
  /* if bus is not locked, initialize the device */
  if(!dev->bus->lock) {
    switch(bus_config->type) {
      case BUS_TYPE_I2C:
        /* Initialize the bus */
        bus_status = serial_init_I2C(dev);
      break;
      case BUS_TYPE_SPI:
        bus_status = serial_init_SPI(dev);
      break;
      case BUS_TYPE_UART:
        bus_status = serial_init_UART(dev);
      break;
      default:
        PRINTF("Serial bus (%s): wrong bus type\n", __func__);
        bus_status = BUS_INVALID;
      break;
    }
    if(bus_status == BUS_OK) {
      /* setup the bus timeout for this device */
      serial_arch_restart_timer(dev);
      /* lock the device by setting the flag and pairing the device pointer */
      dev->bus->lock = 1;
      dev->bus->current_dev = dev;
    }
  }
  return bus_status;
}
/*---------------------------------------------------------------------------*/
serial_bus_status_t
serial_arch_unlock(serial_dev_t *dev)
{
  serial_bus_config_t *bus_config = &dev->bus->config;
  if(dev->bus->lock) {
    if(dev->bus->current_dev == dev) {
      switch(bus_config->type) {
        case BUS_TYPE_I2C:
        /* Reset the I2C controller */
        I2C_Reset(dev->bus->config.I2Cx);
        /* turn off clocks to reduce power consumption */
        if(bus_config->I2Cx == I2C0) {
          CMU_ClockEnable(cmuClock_I2C0, false);
        }
#ifdef I2C1
        if(bus_config->I2Cx == I2C1) {
          CMU_ClockEnable(cmuClock_I2C1, false);
        }
#endif  /* I2C1 */
        break;
        case BUS_TYPE_SPI:
        case BUS_TYPE_UART:
          /* Reset the SPI controller */
          USART_Reset(dev->bus->config.SPI_UART_USARTx);
          /* turn off clocks to reduce power consumption */
          if(bus_config->SPI_UART_USARTx == USART0) {
            CMU_ClockEnable(cmuClock_USART0, false);
            dev_on_uart0 = NULL;
          }
          if(bus_config->SPI_UART_USARTx == USART1) {
            CMU_ClockEnable(cmuClock_USART1, false);
            dev_on_uart1 = NULL;
          }
          if(bus_config->SPI_UART_USARTx == USART2) {
            CMU_ClockEnable(cmuClock_USART2, false);
            dev_on_uart2 = NULL;
          }
        break;
        default:
          PRINTF("Serial bus (%s): wrrong bus typr\n", __func__);
        break;
      } 
    } else {
      return BUS_NOT_OWNED;
    }
    /* unlock the bus */
    dev->bus->lock = 0;
    dev->bus->current_dev = NULL;
  }
  return BUS_OK;
}
/*---------------------------------------------------------------------------*/
void
serial_arch_restart_timer(serial_dev_t *dev)
{
  if(dev->timeout_ms) {
    timer_set(&dev->bus->config.bus_timer, dev->timeout_ms);
  }
}
/*---------------------------------------------------------------------------*/
serial_bus_status_t 
serial_arch_transfer(serial_dev_t *dev, const uint8_t *wdata, 
                    uint16_t write_bytes, uint8_t *rdata, uint16_t read_bytes)
{
  serial_bus_config_t *bus_config = &dev->bus->config;
  uint16_t max_data_lenght;
  uint16_t i = 0;
  uint8_t byte;
  I2C_TransferReturn_TypeDef i2c_ret;
  I2C_TransferSeq_TypeDef i2cTransfer;

  if(dev->bus->lock) {
    if(dev->bus->current_dev == dev) {
      switch(bus_config->type) {
        case BUS_TYPE_I2C:
          /* Initialize the i2c transfer structure, use buf[0] to transfer data  */
        i2cTransfer.addr = dev->address;   /* 7-bit address */
        if(rdata && read_bytes) {
          i2cTransfer.flags = I2C_FLAG_READ;
          i2cTransfer.buf[0].data = rdata;       /* pointer to data where read data will be kept */
          i2cTransfer.buf[0].len = read_bytes;   /* Number of bytes to read */
        } else if(wdata && write_bytes) {
          i2cTransfer.flags = I2C_FLAG_WRITE;
          i2cTransfer.buf[0].data = (uint8_t *)wdata; /* pointer to data */
          i2cTransfer.buf[0].len = write_bytes;       /* Number of bytes to write */
        } else {
          return BUS_INVALID;
        }
        if(bus_config->I2Cx == NULL) {
          return BUS_INVALID;
        }
        /* prepare and start I2C transfer. Call to I2C_TransferInit must 
        *  be made for starting the transfer in master mode */
        i2c_ret = I2C_TransferInit(bus_config->I2Cx, &i2cTransfer);
        if(i2c_ret != i2cTransferDone && i2c_ret != i2cTransferInProgress) {
          return i2c_return_to_bus_status(i2c_ret);
        }
        /* poll using I2C_Transfer function  */
        while(i2c_ret == i2cTransferInProgress && !timer_timedout(&bus_config->bus_timer)) {
#if defined(efr32bg13p) || defined(EFR32BG13P732F512GM48) || defined(efr32xg13)
          if(rdata && read_bytes) {
            /* from efr32xg13-errata R1.1 pdf
            * Errata I2C_E207- I2C Fails to Indicate New Incoming Data.
            *
            * Impacts - A race condition exists in which the I2C fails to indicate reception of 
            * new data when both user software attempts to read data from and
            * the I2C hardware attempts to write data to the I2C_RXFIFO in the same cycle.
            * 
            * Workaround - User software can recognize and clear this invalid RXDATAV = 0 
            * and RXFULL = 1 condition by performing a dummy read of the RXFIFO (I2C_RXDATA).
            */
            if(!(bus_config->I2Cx->STATUS & I2C_STATUS_RXDATAV) &&
              (bus_config->I2Cx->STATUS & I2C_STATUS_RXFULL)) {
                bus_config->I2Cx->RXDATA; /* perform dummy read to fix the issue */
              }
          }
#endif  /* defined(efr32bg13p) || defined(EFR32BG13P732F512GM48) */
          i2c_ret = I2C_Transfer(dev->bus->config.I2Cx);  /* Call to I2C_Transfer must be made to complete the transfer in master mode */
        }
        if(i2c_ret != i2cTransferDone) {
          return i2c_return_to_bus_status(i2c_ret);
        }
        break;
        
        case BUS_TYPE_SPI:
          /* sanity check for read/write data  */
          if(wdata == NULL && write_bytes == 0) {
            return BUS_INVALID;
          }
          if(rdata == NULL && read_bytes == 0) {
            return BUS_INVALID;
          }
          max_data_lenght = (read_bytes > write_bytes) ? read_bytes : write_bytes;
          if(!max_data_lenght) {
            return BUS_OK;
          }
          /* transfer the data. could be read, write or read + write */
          for(i = 0; i < max_data_lenght; i++) {
            byte = (i < write_bytes) ? wdata[i] : 0;
            byte = USART_SpiTransfer(bus_config->SPI_UART_USARTx, byte);
            if(i < read_bytes) {
              rdata[i] = byte;
            }
          }
        break;
        
        case BUS_TYPE_UART:
          /* only write data. Read data will be done via RX interrupt */
          if(!wdata || !write_bytes) {
            return BUS_INVALID;
          }
          for(i = 0; i < write_bytes; i++) {
            USART_Tx(bus_config->SPI_UART_USARTx, wdata[i]);
          }
        break;
        
        default:
          PRINTF("Serial bus (%s): wrong bus type\n", __func__);
      }
    } else {
      return BUS_NOT_OWNED;
    }
  }
  return BUS_OK;
}
/*---------------------------------------------------------------------------*/
serial_bus_status_t
serial_arch_read(serial_dev_t *dev, uint8_t *data, uint16_t len)
{
  return serial_arch_transfer(dev, NULL, 0, data, len);
}
/*---------------------------------------------------------------------------*/
serial_bus_status_t
serial_arch_write(serial_dev_t *dev, const uint8_t *data, uint16_t len)
{
  return serial_arch_transfer(dev, data, len, NULL, 0);
}
/*---------------------------------------------------------------------------*/
void
serial_arch_enable_rx(serial_dev_t *dev)
{
  /* Clear Framing err, parity err and RX overflow err flags */
  USART_IntClear(dev->bus->config.SPI_UART_USARTx, USART_IF_FERR | USART_IF_PERR | USART_IF_RXOF);
  /* clear any pending NVIC interrupts */
  serial_uart_NVIC_clear_interrupt(dev->bus->config.SPI_UART_USARTx, RX_NVIC);
  /* Enable RX data available, framing, parity and overflow interrupt flags */
  USART_IntEnable(dev->bus->config.SPI_UART_USARTx, USART_IF_RXDATAV | USART_IF_FERR | USART_IF_PERR | USART_IF_RXOF);
  /* Enable RX NVIC interrupt request */
  serial_uart_NVIC_interrupt(dev->bus->config.SPI_UART_USARTx, RX_NVIC, true);
}
/*---------------------------------------------------------------------------*/
